In [111]:
import pandas as pd
#df = pd.read_csv("https://gist.github.com/kevin336/acbb2271e66c10a5b73aacf82ca82784/raw/e38afe62e088394d61ed30884dd50a6826eee0a8/employees.csv")

data = {
    "name" : ["Atanu", "Ani", "Rahul", "Avi","Akesh"],
    "age" : [12,13,12,11,14],
    "class" : [8,9,8,7,8],
    "sid" : [1,2,3,4,5],
}

df = pd.DataFrame(data)

df

    name  age  class  sid
0  Atanu   12      8    1
1    Ani   13      9    2
2  Rahul   12      8    3
3    Avi   11      7    4
4  Akesh   14      8    5

In [112]:
df.shape

(5, 4)

In [113]:
df.head(1)

    name  age  class  sid
0  Atanu   12      8    1

In [114]:
df.tail(1)

    name  age  class  sid
4  Akesh   14      8    5

In [115]:
df[2:4]

    name  age  class  sid
2  Rahul   12      8    3
3    Avi   11      7    4

In [116]:
df.name

0    Atanu
1      Ani
2    Rahul
3      Avi
4    Akesh
Name: name, dtype: object

In [117]:
df[["name","age","class"]][df["age"] > 12]

    name  age  class
1    Ani   13      9
4  Akesh   14      8

In [118]:
df["class"].min()

7

In [119]:
df.describe()

             age     class       sid
count   5.000000  5.000000  5.000000
mean   12.400000  8.000000  3.000000
std     1.140175  0.707107  1.581139
min    11.000000  7.000000  1.000000
25%    12.000000  8.000000  2.000000
50%    12.000000  8.000000  3.000000
75%    13.000000  8.000000  4.000000
max    14.000000  9.000000  5.000000

In [120]:
df.set_index("sid",inplace=True)

In [121]:
df

      name  age  class
sid
1    Atanu   12      8
2      Ani   13      9
3    Rahul   12      8
4      Avi   11      7
5    Akesh   14      8

In [125]:
df.loc[1]

name     Atanu
age         12
class        8
Name: 1, dtype: object